[
  {
    "title": {
      "es": "Sistema de Scraping Distribuido & Telemetría",
      "en": "Distributed Scraping & Telemetry System"
    },
    "description": {
      "es": "Arquitectura de ingestión de datos tolerante a fallos utilizando espejos rotativos. Incluye un módulo de telemetría en tiempo real para monitorear throughput, latencia y salud de nodos (33k+ registros diarios con 99.9% uptime).",
      "en": "Fault-tolerant data ingestion architecture using rotating mirrors. Features a real-time telemetry module for monitoring throughput, latency, and node health (33k+ daily records with 99.9% uptime)."
    },
    "status": "completed",
    "tags": ["Python", "Data Engineering", "Telemetry", "ETL"],
    "link": "#"
  },
  {
    "title": {
      "es": "Topología del Discurso Político (NLP + TDA)",
      "en": "Topology of Political Discourse (NLP + TDA)"
    },
    "description": {
      "es": "Investigación sobre rupturas semánticas en redes sociales. Aplica Homología Persistente sobre embeddings vectoriales de tweets para modelar cambios topológicos en la red de opinión pública ante eventos críticos.",
      "en": "Research on semantic ruptures in social media. Applies Persistent Homology on tweet vector embeddings to model topological changes in public opinion networks during critical events."
    },
    "status": "active",
    "tags": ["TDA", "Python", "NLP", "Social Graphs"],
    "link": "#"
  },
  {
    "title": {
      "es": "Estabilidad en Límites de Grafos Densos",
      "en": "Stability in Dense Graph Limits"
    },
    "description": {
      "es": "Investigación matemática sobre la convergencia asintótica de diagramas de persistencia en Graphons y Complexons. Busca demostrar la estabilidad topológica bajo la norma de corte en procesos estocásticos.",
      "en": "Mathematical research on the asymptotic convergence of persistence diagrams in Graphons and Complexons. Aims to prove topological stability under the cut norm in stochastic processes."
    },
    "status": "active",
    "tags": ["Math Research", "Graphons", "Topology", "Stochastic Processes"],
    "link": "#"
  },
  {
    "title": {
      "es": "Pipeline NoSQL: Ingesta y Analítica",
      "en": "NoSQL Pipeline: Ingestion & Analytics"
    },
    "description": {
      "es": "Implementación de un flujo ETL completo: Consumo de APIs públicas, almacenamiento de datos crudos en MongoDB y procesamiento estadístico (EDA) para descubrir correlaciones en datos semi-estructurados.",
      "en": "Implementation of a full ETL workflow: Public API consumption, raw data storage in MongoDB, and statistical processing (EDA) to uncover correlations in semi-structured data."
    },
    "status": "completed",
    "tags": ["MongoDB", "Python", "APIs", "Data Science"],
    "link": "#"
  },
  {
    "title": {
      "es": "Visualización Didáctica: TDA & Graphons",
      "en": "Didactic Visualization: TDA & Graphons"
    },
    "description": {
      "es": "Notebook computacional diseñado para la divulgación académica. Ilustra interactivamente la conexión teórica entre los invariantes topológicos y el límite de grafos densos.",
      "en": "Computational notebook designed for academic dissemination. Interactively illustrates the theoretical connection between topological invariants and the limit of dense graphs."
    },
    "status": "completed",
    "tags": ["Jupyter", "Education", "Math", "Visualization"],
    "link": "#"
  }
]